#Cats

In [14]:
a=10
b=20
print("a-b=",a-b)

a-b= -10

In [17]:
a=input(int)
n=input(int)
p=pow(a,n)
print(p)

<class 'int'>23
<class 'int'>2

TypeError: unsupported operand type(s) for ** or pow(): 'str' and 'str'

In [18]:
!pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in /opt/anaconda3/lib/python3.9/site-packages (1.4.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/anaconda3/lib/python3.9/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/anaconda3/lib/python3.9/site-packages (from pandas) (2021.3)
Requirement already satisfied: numpy>=1.18.5 in /opt/anaconda3/lib/python3.9/site-packages (from pandas) (1.21.5)
Requirement already satisfied: six>=1.5 in /opt/anaconda3/lib/python3.9/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [19]:
import pandas as pd

In [23]:
import pandas as pd
Series=pd.Series(["car","bus","bike"])
print(Series)

0     car
1     bus
2    bike
dtype: object

In [25]:
import pandas as pd
Series=pd.Series(["car","bus","bike"],index=["1","2","3"])
Series

1     car
2     bus
3    bike
dtype: object

In [26]:
import pandas as pd
Series=pd.Series(["car","bus","bike"],index=["1","2","3"])
Series[1]

'bus'

In [38]:
import pandas as pd
Series=pd.Series(["car","bus","bike"],index=["1","2","3"])
Series[0:2]

1    car
2    bus
dtype: object

In [43]:
import pandas as pd
Colors=pd.Series(["Red","Blue","Black"])
Colors

0      Red
1     Blue
2    Black
dtype: object

In [44]:
import pandas as pd
a=[1,2,3]
Series=pd.Series(["car","bus","bike"],index=a)
Series

1     car
2     bus
3    bike
dtype: object

In [9]:
import pandas as pd
Series=pd.Series(["Car","Bike","Bus"],index=["1",'2','3'])
Colors=pd.Series(["Red","Blue","Black"])
car=pd.DataFrame({"Vehicles":Series,"Colors":Colors})
car

  Vehicles Colors
1      Car    Red
2     Bike   Blue
3      Bus  Black

In [10]:
car=pd.DataFrame({"Vehicles":Series,"Colors":Colors})
car

  Vehicles Colors
1      Car    Red
2     Bike   Blue
3      Bus  Black

In [13]:
hi=pd.DataFrame({"colors":Colors,"Vehicles":Series})
hi

  colors Vehicles
1    Red      Car
2   Blue     Bike
3  Black      Bus

In [21]:
data={
    "Names":["Kausthubh","Suresh","Pawan"],index=["1","2","3"]
    "RollNo":[21,22,23]
}
df=pd.DataFrame(data)
df

SyntaxError: invalid syntax (2916417365.py, line 2)

In [30]:
Sname=pd.Series(["Kausthubh","Suresh","Pawan"],index=["1","2","3"])
USN=pd.Series(["4NM21AI036","4NM21AI037","4NM21AI038"],index=["1","2","3"])
df=pd.DataFrame({"Student Name":Sname,"USN":USN})
df

  Student Name         USN
1    Kausthubh  4NM21AI036
2       Suresh  4NM21AI037
3        Pawan  4NM21AI038

In [36]:
#DataFrame with key Sem,Marks,Grade df.head()which gives the first 5 tuples, df.tail()gives last 5 tuples,df.describe()gives statistical analysis df.columnsdata={
    "Semester":[1,2,3,4,5,6],
    "Marks":[95,96,93,92,93,95],
    "Grade":['A+','A+','A','A','A','A+']
}
df=pd.DataFrame(data)
df.head(2)
 gives column names
data={
    "Semester":[1,2,3,4,5,6],
    "Marks":[95,96,93,92,93,95],
    "Grade":['A+','A+','A','A','A','A+']
}
df=pd.DataFrame(data)
df.tail(2)

   Semester  Marks Grade
4         5     93     A
5         6     95    A+

In [37]:
#df.head
data={
    "Semester":[1,2,3,4,5,6],
    "Marks":[95,96,93,92,93,95],
    "Grade":['A+','A+','A','A','A','A+']
}
df=pd.DataFrame(data)
df.head(2)

   Semester  Marks Grade
0         1     95    A+
1         2     96    A+

In [38]:
#df.describe
data={
    "Semester":[1,2,3,4,5,6],
    "Marks":[95,96,93,92,93,95],
    "Grade":['A+','A+','A','A','A','A+']
}
df=pd.DataFrame(data)
df.describe()

       Semester      Marks
count  6.000000   6.000000
mean   3.500000  94.000000
std    1.870829   1.549193
min    1.000000  92.000000
25%    2.250000  93.000000
50%    3.500000  94.000000
75%    4.750000  95.000000
max    6.000000  96.000000

In [49]:
#df.columns
data={
    "Semester":[1,2,3,4,5,6],
    "Marks":[95,96,93,92,93,95],
    "Grade":['A+','A+','A','A','A','A+']
}
df=pd.DataFrame(data)
df.columns

Index(['Semester', 'Marks', 'Grade'], dtype='object')

In [51]:
#Display  the elements of a dataframe
data={
    "Semester":[1,2,3,4,5,6],
    "Marks":[95,96,93,92,93,95],
    "Grade":['A+','A+','A','A','A','A+']
}
df=pd.DataFrame(data)
print(df["Marks"])

0    95
1    96
2    93
3    92
4    93
5    95
Name: Marks, dtype: int64

In [52]:
#for more than 1 element of a dataframe
data={
    "Semester":[1,2,3,4,5,6],
    "Marks":[95,96,93,92,93,95],
    "Grade":['A+','A+','A','A','A','A+']
}
df=pd.DataFrame(data)
print(df[["Marks","Grade"]])

   Marks Grade
0     95    A+
1     96    A+
2     93     A
3     92     A
4     93     A
5     95    A+

In [1]:
import pandas as pd

In [3]:
import pandas as pd
Color=pd.Series(["Red","Blue","Green"])
Vehicle=pd.Series(["Car","BIke","Truck"])
df=pd.DataFrame({"Colors":Color,"Vehicles":Vehicle})
df

  Colors Vehicles
0    Red      Car
1   Blue     BIke
2  Green    Truck